{
  "backend/main.mo": "Motoko backend with access‑controlled player profiles, score submission with rate limiting, and data structures for scores, daily challenges, and stats.",
  "feature_evidence.json": "Feature evidence report mapping features to related files, components, tests, and confidence metadata.",
  "frontend-file-summaries.txt": "Reference list providing short descriptions of all frontend files and their roles in the game.",
  "frontend/index.css": "Tailwind CSS setup defining light and dark theme variables and base styling.",
  "frontend/index.html": "HTML entry point loading the root div and main React script.",
  "frontend/src/App.tsx": "Main React app configuring router routes, theme provider, and global layout components.",
  "frontend/src/components/AppLayout.tsx": "Shared app layout with header, navigation, mobile menu, footer, and outlet for pages.",
  "frontend/src/components/AsyncState.tsx": "Utility component handling loading, error, empty, and success UI states.",
  "frontend/src/components/AuthButton.tsx": "Internet Identity login/logout button handling authentication flow and query cache resets.",
  "frontend/src/components/LeaderboardTable.tsx": "Displays a styled leaderboard table with ranks, players, scores, and difficulty, highlighting the current user.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Shows a dialog prompting new authenticated users to enter and save a display name.",
  "frontend/src/components/ResultsShareCard.tsx": "Renders a shareable score card and provides copy-to-clipboard and image download actions.",
  "frontend/src/components/TutorialOverlay.tsx": "Provides a multi‑step tutorial modal that guides users through game basics and modes.",
  "frontend/src/game/controls.ts": "Manages keyboard and touch input to produce directional and boost actions for gameplay.",
  "frontend/src/game/engine.ts": "Implements the game loop, handling movement, spawning, collisions, scoring, and deterministic randomness.",
  "frontend/src/game/renderCanvas.ts": "Initializes the canvas and renders the player, obstacles, collectibles, and background each frame.",
  "frontend/src/game/rng.ts": "Provides a simple seeded random number generator with helpers for ranges and choices.",
  "frontend/src/game/types.ts": "Defines TypeScript types for game configuration, entities, state, and input.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, high scores, daily challenges, and submitting scores via the backend actor.",
  "frontend/src/index.css": "Tailwind base styles plus CSS variables for light/dark themes and global typography settings.",
  "frontend/src/main.tsx": "App entry point that mounts React, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/HomePage.tsx": "Home screen showing hero banner, game mode navigation, and tutorial overlay handling.",
  "frontend/src/pages/LeaderboardsPage.tsx": "Displays leaderboards with multiple score filters, fetching data and highlighting the current user.",
  "frontend/src/pages/PlayDailyPage.tsx": "Initializes and runs the daily challenge game loop, handling canvas setup, controls, scoring, pausing, and navigation on game over.",
  "frontend/src/pages/PlayStandardPage.tsx": "Initializes and runs the standard game loop, manages pause, score, navigation, and canvas rendering.",
  "frontend/src/pages/ProfilePage.tsx": "Displays and edits the user's profile and stats, with authentication checks and save functionality.",
  "frontend/src/pages/ResultsPage.tsx": "Shows game-over results, submits scores when authenticated, and provides replay/navigation options.",
  "frontend/src/pages/SettingsPage.tsx": "Provides toggles for audio and accessibility settings using the settings store.",
  "frontend/src/state/onboardingStore.ts": "Zustand store persisting whether the tutorial was dismissed, with actions to dismiss or reset.",
  "frontend/src/state/progressionStore.ts": "Zustand store for progression data like speed multipliers, best scores, streaks, and tutorial completion.",
  "frontend/src/state/settingsStore.ts": "Zustand store managing sound and motion settings with toggle actions.",
  "frontend/src/utils/dateKey.ts": "Generates a UTC day key and formats day keys into human-readable dates.",
  "frontend/src/utils/renderCardToImage.ts": "Renders an HTML element to a canvas-based image and provides a helper to download the resulting blob.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using URLSearchParams and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining content paths, theme extensions for colors, layout, animations, and fonts, plus plugin setup.",
  "project_state.json": "Project metadata describing game concept goals, required images, and a list of implemented high‑level features with versioning."
}